{
  "site_name": "Ignosis",
  "scrape_time": "2025-11-23 21:44:23",
  "total_jobs": 1,
  "jobs": {
    "job_role": "Senior Software Engineer",
    "job_experience": "Years of Experience: 5+",
    "job_overview": "As a Senior Software Engineer at Ignosis, you’ll spearhead the development of innovative products, driving the technical vision and implementation. Your role involves leading the design and optimization of robust software solutions. With your advanced technical expertise, you will play a pivotal role in elevating our products, contributing to the company’s success in the dynamic landscape of technology and innovation.",
    "job_responsibilities": "Be the thinker and problem solver at large scale for the projects involved. Building large platform pieces to enable external RESTful web services for the scale of 100 million+ API transactions every day. Actively participate in development along with team members for as much as 75% of their time, creating modules & systems that can then be treated as a working reflection of the best practices. Participating in code reviews, design reviews, architecture discussions. Being responsible for Scaling, Performance & Quality for the team. Handle massive amounts of data being generated every day and building relevant analytics, insights and monitoring wherever needed. Incorporate long-term thinking at low level design and high-level design into products and develop the similar culture at team level. Implementation of long-term technology vision for the company. Keep yourself updated with the relevant latest industry tech developments and advancements. Drive technology & tool choices for your team & be responsible for them. Not restricting yourself with only above responsibilities and going beyond your role & contributing to make the organization & business better.",
    "job_requirements": "4+ years of engineering experience and 3+ years of scalable product development cycles with either large data handling or large transaction processing Hands on experience over scalable RESTful web services and massive data sets. Solid coding skills with ability to drive teams through massive refactoring exercises & improve coding standards across large code bases in Java. Must have hands-on experience in PostgreSQL Very Strong System design and OO skills with a nifty ability to craft clean interfaces and operate at the right levels of abstraction. Quick & Excellent Problem-Solving skills for complex & large-scale problems. Technical Breadth – Exposure to a wide variety of problem spaces, technologies. Good knowledge, understanding & experience of working with a variety of multi-tier architectures. Awareness of pitfalls & use cases for a variety of solutions. Good understanding & experience of high-performance web scale & real-time response systems. Experience & exposure to a variety of large-scale persistent systems including large databases. Exposure to complete product development cycles – From inception to production to scaling up, supporting new requirements, re-architectures – the Architects should have seen it all. Must be comfortable working in fuzzy environments – where boundaries aren’t clearly defined. B Tech or higher in Computer Science or equivalent required."
  }
}